import React, { useEffect } from 'react';
import { useLocation } from 'react-router-dom';
import styles from './ServicesPage.module.css';

const ServicesPage = () => {
  const location = useLocation();

  useEffect(() => {
    if (location.hash) {
      const sectionId = location.hash.slice(1);
      const section = document.getElementById(sectionId);
      if (section) {
        section.scrollIntoView({ behavior: 'smooth' });
      }
    }
  }, [location]);

  return (
    <div className={styles.pageContainer}>
      <h1>Про послуги</h1>
        <p className={styles.description}>
        Платформа пропонує спектр послуг, розроблених з урахуванням
        різноманітних потреб користувачів, які пережили
        дорожньо-транспортні пригоди та інші травматичні події.
        Ми прагнемо забезпечити комплексний підхід до психологічної
        реабілітації, поєднуючи професійні інструменти, можливості
        самодопомоги та підтримку спільноти.</p>

      <section id="assessment" className={styles.section}>
        <h2>Онлайн-тестування</h2>
        <p>Система оцінки психологічного стану користувачів здійснюється
          за допомогою валідних та стандартизованих психологічних тестів,
          доступних за посиланням. Це загальний тест після ДТП, призначений
          для первинної оцінки емоційного та психічного стану, виявлення
          можливих симптомів тривоги, депресії, посттравматичного стресового
          розладу (ПТСР) та інших психологічних проблем. Тести розроблені з
          урахуванням міжнародних стандартів та рекомендацій у сфері
          психічного здоров'я. </p>
        <p>Автоматизована обробка результатів тестування дозволяє
          надати персоналізовані рекомендації, що можуть включати
          перелік корисних матеріалів, посилання на тематичні розділи
          сайту, поради щодо подальших дій та, за потреби, рекомендації
          звернутися до фахівця. На основі результатів тестування
          визначаються найбільш релевантні тематичні розділи для
          подальшої роботи з платформою, що дозволяє користувачам
          швидко знаходити інформацію, яка відповідає їхнім потребам.</p>
      </section>

      <section id="library" className={styles.section}>
        <h2>Навчальні матеріали</h2>
        <p>
        Бібліотека інформаційних ресурсів, включаючи статті, відео та
        аудіозаписи, присвячені різним аспектам психологічної реабілітації,
        самодопомоги та підтримки ментального здоров'я. Цей розділ містить
        тематичні розділи з інформацією про поширені психологічні проблеми,
        стратегії їх подолання, практичні вправи та техніки, такі як
        медитації, дихальні вправи та інші методи саморегуляції, для
        самостійної роботи та покращення психологічного стану.
      </p>
      </section>

      <section id="community" className={styles.section}>
        <h2>Форум</h2>
        <p>
        Платформа для обміну досвідом, висловлювання почуттів та
        взаємної підтримки між користувачами, які пережили схожі
        травматичні події. Він є важливим елементом платформи, що
        забезпечує можливість для користувачів спілкуватися, ділитися
        переживаннями, отримувати підтримку та поради, коментувати
        публікації, створювати нові теми для обговорення, брати участь
        у дискусіях, сприяючи формуванню спільноти, почуттю приналежності,
        зменшенню ізоляції та створенню атмосфери взаєморозуміння.
      </p>
      </section>

      <section id="emotion" className={styles.section}>
        <h2>Щоденник емоцій</h2>
        <p>
        Інструмент для ведення особистих записів про емоційний стан,
        пережиті травматичні події, думки, почуття та прогрес у процесі
        відновлення. Він дозволяє користувачам фіксувати свої емоційні
        переживання, спостереження та роздуми у текстовій формі для
        самоаналізу, рефлексії, відстеження динаміки психологічного
        стану, ідентифікації тригерів, а також для розуміння власних
        емоційних реакцій та змін у психологічному стані з часом.
      </p>
      </section>
    </div>
  );
};

export default ServicesPage;
