import React from 'react';
import styles from './AboutUs.module.css';

const AboutUs = () => {
  return (
    <section id="about-section" className={styles.aboutUsSection}>
      <div className={styles.container}>
        <h2>Про нас</h2>
        <p className={styles.description}>
          Цей веб-сайт є комплексною платформою, розробленою з метою
          надання психологічної реабілітації та всебічної підтримки особам,
          які пережили дорожньо-транспортні пригоди та інші травматичні події.
          Ми глибоко розуміємо, наскільки складним і тривалим може бути процес
          відновлення після таких інцидентів, і прагнемо створити безпечний,
          зручний та ефективний онлайн-простір, де кожен, хто потребує допомоги,
          зможе знайти необхідні ресурси та підтримку.
        </p>
        <p className={styles.description}>
          Наша місія полягає у забезпеченні доступності якісної
          психологічної допомоги, незалежно від місця проживання
          чи обставин. Ми прагнемо допомогти користувачам на кожному
          етапі їхнього шляху до відновлення, надаючи інструменти та
          інформацію, що сприяють психологічному зростанню та
          покращенню загального самопочуття.
        </p>
      </div>
    </section>
  );
};

export default AboutUs;